---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.OuterLoopIsNotFirst
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.OuterLoopIsNotFirst

A face have multiple loops, but the outer loop is not listed as the
 very first one.
 Associated numbers are face and loop indices respectively.